

/*----------------------------------------------------------------*/

/*論理和*/

var And = document.querySelector ('.And');
var x = 3;
var y = 4;

var ans = x < 4 && y == 4;
And.innerText = ans + 'です';

/*----------------------------------------------------------------*/


/*----------------------------------------------------------------*/

/*論理積*/

var Sum = document.querySelector ('.Sum');
var x2 = 3;
var y2 = 4;
console.log(Sum);

var ans2 = x2 == 31 || y2 <= -41;
Sum.innerText = ans2 + 'です';

/*----------------------------------------------------------------*/

/*----------------------------------------------------------------*/

/*否定の使い方*/

var Not1 = document.querySelector ('.Not1');
var Not2 = document.querySelector ('.Not2');
var x3 = 1;
var ans3 = x3 < -4;

Not1.innerText = ans3 + 'です';
Not2.innerText = !ans3 + 'です';

// ４１行目は　正しくなければ「true」を返す

/*----------------------------------------------------------------*/


